app/controllers/charts_controller.rb

SELECT * FROM "charts" WHERE ("charts"."id" = 1)
---
  def show
    @chart = Chart.find(params[:id])

INSERT INTO "charts" ("thing5", "updated_at", "thing4amount", "title", "thing5amount", "thing1amount", "thing2amount", "thing1", "thing3amount", "thing2", "thing3", "thing4", "created_at") VALUES('Small nuts', '2009-02-09 20:37:19', '3', 'First Real Test', '2', '1', '1', 'Left nut', '5', 'Right nut', 'My nuts', 'Big nuts', '2009-02-09 20:37:19')
---
  def create
    @chart = Chart.new(params[:chart])

    respond_to do |format|
      if @chart.save